package todo;

public class TodoList {
//	TODO LIST
//	====================
//	1. 등록
//	2. 수정
//	3. 삭제
//	4. 조회
//	5. 종료
//	====================
//	메뉴를 입력하세요:
//	1
//	TODO 명을 입력하세요:
//	Java 과제 하기
//	아이템이 등록되었습니다.
//	====================
//	1. 등록
//	2. 수정
//	3. 삭제
//	4. 조회
//	5. 종료
//	====================
//	메뉴를 입력하세요:
//	2
//	수정할 아이템 번호를 입력하세요:
//	1
//	아이템이 완료되었다면 "Y"를 입력하세요:
//	Y
//	[아이템명]이 완료되었습니다.
//	N
//	[아이템명]이 미완료되었습니다.
//	====================
//	1. 등록
//	2. 수정
//	3. 삭제
//	4. 조회
//	5. 종료
//	====================
//	메뉴를 입력하세요:
//	3
//	삭제할 아이템 번호를 입력하세요:
//	1
//	아이템이 삭제되었습니다.
//	999
//	아이템이 존재하지 않습니다.
//	====================
//	1. 등록
//	2. 수정
//	3. 삭제
//	4. 조회
//	5. 종료
//	====================
//	메뉴를 입력하세요:
//	4
//	[ ] 아이템명
//	[X] 아이템명
//	[ ] 아이템명
//	[ ] 아이템명
//	총 4개의 아이템이 조회되었습니다.
//	====================
//	1. 등록
//	2. 수정
//	3. 삭제
//	4. 조회
//	5. 종료
//	====================
//	메뉴를 입력하세요:
//	5
//	프로그램이 종료되었습니다.
//
// TodoItemVO.java
//  생성자: TodoItemVO(String 아이템명)
//	완료여부 : boolean (true일 경우는 완료, false는 미완료)
//	아이템명 :  String
// TodoItemService.java
// 생성자(): 기본생성자
// 아이템목록 : List<TodoItemVO>
// 등록(String 아이템명) : void
// 수정(int index,boolean 완료여부):void
// 삭제(int index): void
// 조회() : void
// main()
}